# импортируем настройки для отражения эмоджи
from .config import KEYBOARD, VERSION, AUTHOR

# ответ пользователю при посещении блока "О магазине"
scverna_store = """

📌 Добро пожаловать в магазин цифорвых товаров ScvernaShop 📌 

🧾Данное приложение разработано для покупки цифровых товаров,
через телеграм бота, что является очень удобным и быстрым способом для покупки нашей продукции.
Интернет-магазин цифровых товаров предоставляет услуги по продаже разнообразных цифровых товаров, таких как цифровые подписки на различные сервисы по выгодным ценам, 
аккунты из различных игр и другие цифровые продукты. Магазин предлагает пользователям широкий выбор товаров, 
разделенных по категориям, 
а также обеспечивает возможность быстрого и удобного оформления покупок через телеграм-бота.🧾

🌟Приложение имеет удобный и понятно-интуитивный интерфейс для пользователей любых возрастов.
"""
# ответ пользователю при посещении блока "Настройки"
settings = """
<b>📖 Руководство по интерфейсу 📖</b>

<i>📌Взаимодействие с товаром</i>

-<b>(⬅) - </b><i>назад</i>
-<b>(➡) - </b><i>вперед</i>
-<b>(🔼) - </b><i>увеличить</i>
-<b>(🔽) - </b><i>уменьшить</i>
-<b>(▶) - </b><i>следующий</i>
-<b>(◀) - </b><i>предыдующий</i>

<i>📌Кнопки служащие для оформления заказа</i>

-<b>(❌) - </b><i>удалить</i>
-<b>(🗑️) - </b><i>заказ</i>
-<b>(✅➡🗑️) - </b><i>Оформить заказ</i>

<i>📌Общая информация по telegram-bot</i>

-<b>версия программы: - </b><i>(1.1.3)</i>
-<b>разработчик: - </b><i>(Odani) : Связь: @odanizy
</i>


<b> odani - (Роман) </b>

""".format(
    KEYBOARD['<<'],
    KEYBOARD['>>'],
    KEYBOARD['UP'],
    KEYBOARD['DOUWN'],
    KEYBOARD['NEXT_STEP'],
    KEYBOARD['BACK_STEP'],
    KEYBOARD['X'],
    KEYBOARD['ORDER'],
    KEYBOARD['APPLAY'],
    VERSION,
    AUTHOR,
    KEYBOARD['COPY'],
)
# ответ пользователю при добавлении товара в заказ
product_order = """
Выбранный товар:

{}
{}
Cтоимость: {} руб

добавлен в заказ!!!

На складе осталось {} ед. 
"""
# ответ пользователю при посещении блока с заказом
order = """

<i>Название:</i> <b>{}</b>

<i>Описание:</i> <b>{}</b>

<i>Cтоимость:</i> <b>{} руб за 1 ед.</b>

<i>Количество позиций:</i> <b>{} ед.</b> 
"""

order_number = """

<b>Позиция в заказе № </b> <i>{}</i>

"""
# ответ пользователю, когда заказа нет
no_orders = """
<b>❗Выберите товар из предложенных категорий - 🗑️КОРЗИНА ПУСТА❗</b>
"""

# ответ пользователю при подтверждении оформления заказа
applay = """
<b>Ваш заказ оформлен !!!</b>

<i>Общая стоимость заказа составляет:</i> <b>{} руб</b>

<i>Общее количество позиций составляет:</i> <b>{} ед.</b>

<b>📌Ожидайте сообщения от поддержки для подтверждения заказа📌</b>
"""
# словарь ответов пользователю
MESSAGES = {
    'scverna_store': scverna_store,
    'product_order': product_order,
    'order': order,
    'order_number': order_number,
    'no_orders' : no_orders,
    'applay': applay,
    'settings': settings
}
